app/Helpers/usuario_helper.php

    function obtener_sucursal_usuario()
    {
        if (!auth()->loggedIn()) {
            return 'SUCUR0000X';
        }

        $userId = auth()->id();

        // Llamamos al modelo directamente con la función global de CI4
        // (Ajusta el nombre de la clase si tu modelo se llama distinto)
        $gymModel = model(\App\Models\GymnasiosModel::class);

        // Hacemos la consulta
        $gym = $gymModel->where('users_id', $userId)->first();
---
SELECT *
FROM `gymnasios`
WHERE `users_id` = 1
 LIMIT 1