app/Controllers/Home.php

SELECT *
FROM `servicios`
WHERE `Catalogo` = 'MEMBRESIA'
SELECT *
FROM `servicios`
WHERE `Catalogo` = 'EXTRAS'
---
    public function index(): string
    {


         $idUser = obtener_username(); // obtengo el id User de la Sesion

        $servicioModel = new Servicios();

        // 1. Filtrar usando las funciones de CodeIgniter:
        // Traemos solo los que dicen "MEMBRESIA"
        $membresias = $servicioModel->where('Catalogo', 'MEMBRESIA')->findAll();

        // Traemos solo los que dicen "EXTRAS"
        $extras = $servicioModel->where('Catalogo', 'EXTRAS')->findAll();