app/Controllers/Recepcion.php

SELECT *
FROM `clientes`
WHERE `clientes`.`IDClientes` = '33'
---
            $builder->groupBy('c.IDClientes');
            $builder->orderBy('c.IDClientes', 'DESC');

            $pendientes = $builder->get()->getResultArray();