app/Controllers/Recepcion.php

SELECT *
FROM `servicios`
WHERE `Catalogo` = 'MEMBRESIA'
SELECT *
FROM `servicios`
WHERE `Catalogo` = 'EXTRAS'
---
    public function index()
    {
 // parte de renovaciones
 $membresiaModel = model(\App\Models\RegistroMembresiaModel::class);

        // Capturamos lo que el usuario haya escrito en la barra de búsqueda (GET)
        $telefonoBuscar = $this->request->getGet('telefono');

        // Llamamos a la función: le pasamos la búsqueda, avisamos desde 5 días antes, y paginamos de 10 en 10
        $clientes = $membresiaModel->obtenerClientesParaRenovacion($telefonoBuscar, 5, 5);

        $datarenovaciones = [
            'titulo'   => 'Panel de Renovaciones | VitalGym',
            'username' => obtener_username(),
            'clientes' => $clientes,
            'pager'    => $membresiaModel->pager,
            'busqueda' => $telefonoBuscar // Lo mandamos a la vista para dejarlo escrito en el input
        ];
     // termina parte de renovaciones

        $serviciosModel =  model(\App\Models\Servicios::class);
        // Mandamos los servicios a la vista para llenar el select del modal
        $data['servicios'] = $serviciosModel->where('Catalogo', 'MEMBRESIA')->findAll();
        $data['extras'] = $serviciosModel->where('Catalogo', 'EXTRAS')->findAll();

SELECT `c`.`IDClientes`, `c`.`Nombre`, `c`.`ApellidoP`, `c`.`ApellidoM`, `c`.`Telefono`, `c`.`Firma`, `rm`.`idRegistros_Membresia`
FROM `clientes` `c`
LEFT JOIN `registros_membresia` `rm` ON `rm`.`Clientes_IDClientes` = `c`.`IDClientes`
WHERE `c`.`Huella` IS NULL
GROUP BY `c`.`IDClientes`
---
public function obtenerPendientesAJAX()
    {
        if ($this->request->isAJAX()) {

            // Usamos el Query Builder para hacer un LEFT JOIN con la tabla de membresías
            $db = \Config\Database::connect();
            $builder = $db->table('clientes c');

            // Seleccionamos los datos del cliente y el ID de su membresía (si es que ya tiene)
            $builder->select('c.IDClientes, c.Nombre, c.ApellidoP, c.ApellidoM, c.Telefono, c.Firma, rm.idRegistros_Membresia');
            $builder->join('registros_membresia rm', 'rm.Clientes_IDClientes = c.IDClientes', 'left');

            // La regla principal: Aún no tienen huella
            $builder->where('c.Huella IS NULL');

            // Agrupamos por si acaso hay algún registro duplicado
            $builder->groupBy('c.IDClientes');

            $pendientes = $builder->get()->getResultArray();