app/Controllers/Recepcion.php

public function obtenerPendientesAJAX()
    {
        if ($this->request->isAJAX()) {

            // Usamos el Query Builder para hacer un LEFT JOIN con la tabla de membresías
            $db = \Config\Database::connect();
            $builder = $db->table('clientes c');

            // Seleccionamos los datos del cliente y el ID de su membresía (si es que ya tiene)
            $builder->select('c.IDClientes, c.Nombre, c.ApellidoP, c.ApellidoM, c.Telefono, c.Firma, rm.idRegistros_Membresia');
            $builder->join('registros_membresia rm', 'rm.Clientes_IDClientes = c.IDClientes', 'left');

            // La regla principal: Aún no tienen huella
            $builder->where('c.Huella IS NULL');

            // Agrupamos por si acaso hay algún registro duplicado
            $builder->groupBy('c.IDClientes');

            $pendientes = $builder->get()->getResultArray();
---
SELECT `c`.`IDClientes`, `c`.`Nombre`, `c`.`ApellidoP`, `c`.`ApellidoM`, `c`.`Telefono`, `c`.`Firma`, `rm`.`idRegistros_Membresia`
FROM `clientes` `c`
LEFT JOIN `registros_membresia` `rm` ON `rm`.`Clientes_IDClientes` = `c`.`IDClientes`
WHERE `c`.`Huella` IS NULL
GROUP BY `c`.`IDClientes`