app/Controllers/Renovaciones.php

    public function index($idCliente)
    {
        $clienteModel = new Cliente();
        $servicioModel = new Servicios();

        // Buscamos al cliente
        $cliente = $clienteModel->find($idCliente);
        if (!$cliente) {
            return redirect()->to(base_url('/renovaciones'))->with('error', 'Cliente no encontrado.');
        }

        // Traemos catálogos
        $membresias = $servicioModel->where('Catalogo', 'MEMBRESIA')->findAll();
        $extras = $servicioModel->where('Catalogo', 'EXTRAS')->findAll();
---
SELECT *
FROM `servicios`
WHERE `Catalogo` = 'MEMBRESIA'
SELECT *
FROM `servicios`
WHERE `Catalogo` = 'EXTRAS'