app/Controllers/Tienda.php

    public function index()
    {

        $productoModel = new \App\Models\ProductoModel();

            $data['productos'] = $productoModel->where('Stock >', 0)->get()->getResult();;
---
SELECT *
FROM `productos`
WHERE `Stock` > 0