app/Models/AsistenciaChecador.php

    public function obtenerAsistenciasPorRango($fechaInicio, $fechaFin, $userId = 'todos')
    {
        $builder = $this->select('asistenciachecador.*, users.username')
                    ->join('users', 'users.id = asistenciachecador.users_id')
                    ->where('DATE(FechaHora_Registro_Entrada) >=', $fechaInicio)
                    ->where('DATE(FechaHora_Registro_Entrada) <=', $fechaFin);

        // Si el administrador seleccionó a alguien en particular, filtramos por su ID
        if ($userId !== 'todos' && !empty($userId)) {
            $builder->where('asistenciachecador.users_id', $userId);
        }

        return $builder->orderBy('FechaHora_Registro_Entrada', 'DESC')->findAll();
---
SELECT `asistenciachecador`.*, `users`.`username`
FROM `asistenciachecador`
JOIN `users` ON `users`.`id` = `asistenciachecador`.`users_id`
WHERE DATE(FechaHora_Registro_Entrada) >= '2026-03-30'
AND DATE(FechaHora_Registro_Entrada) <= '2026-04-05'
ORDER BY `FechaHora_Registro_Entrada` DESC