app/Models/Cliente.php

SELECT *
FROM `servicios`
WHERE `servicios`.`IDServicios` = '1'
INSERT INTO `pago` (`Tipo_Pago`, `Concepto`, `Monto`, `Fecha_Pago`) VALUES ('Transferencia', 'Inscripción - MENSUALIDAD XOXO  + Extras', '550.00', '2026-04-13 21:59:27')
---
 public function completarInscripcionExistente($datos)
    {
        $pagoModel = model('App\Models\PagoModel');
        $membresiaModel = model('App\Models\RegistroMembresiaModel');
        $serviciosModel = model('App\Models\Servicios');
        $membresiaextrasModel = model('App\Models\MembresiaExtras');

        $this->db->transStart();

        try {
            $servicio = $serviciosModel->find($datos['Servicios_IDServicios']);
            if (!$servicio) {
                throw new \Exception("El servicio seleccionado no existe.");
            }

            // PAGO
            $conceptoPago = 'Inscripción - ' . ($servicio['NombreMembresia'] ?? 'Servicio');
            if (!empty($datos['ExtraID'])) {
                $conceptoPago .= ' + Extras';
            }

            $datosPago = [
                'Tipo_Pago'  => $datos['Tipo_Pago'],
                'Concepto'   => $conceptoPago,
                'Monto'      => $datos['MontoTotal'],
                'Fecha_Pago' => date('Y-m-d H:i:s')
            ];

            // Validar si el insert falla
            if ($pagoModel->insert($datosPago) === false) {

INSERT INTO `membresia_extras` (`Registros_Membresia_id`, `Servicios_IDServicios`) VALUES (62, '7')
---
            if (!empty($datos['ExtraID']) && is_array($datos['ExtraID'])) {
                for ($i = 0; $i < count($datos['ExtraID']); $i++) {
                    if (!empty($datos['ExtraID'][$i])) {
                        if ($membresiaextrasModel->insert([
                            'Registros_Membresia_id' => $idRegistroMembresia,
                            'Servicios_IDServicios'  => $datos['ExtraID'][$i]
                        ]) === false) {