app/Models/PagoModel.php

SELECT SUM(Monto) as total_monto
FROM `pago`
WHERE `Tipo_Pago` = 'Efectivo'
AND `Fecha_Pago` >= '2026-03-30 00:00:00'
AND `Fecha_Pago` <= '2026-03-30 23:59:59'
 LIMIT 1
---
    public function ingresosMetodoPagoHoy($metodo, $sucursal = 'TODOS')
    {
        $builder = $this->select('SUM(Monto) as total_monto')
                        ->where('Tipo_Pago', $metodo)
                        ->where('DATE(Fecha_Pago)', date('Y-m-d'));

        if ($sucursal !== 'TODOS') {
            $builder->where('id_gimnasio', $this->getSucursalId($sucursal));
        }

        $row = $builder->first();

SELECT SUM(Monto) as total_monto
FROM `pago`
WHERE `Tipo_Pago` = 'Efectivo'
AND MONTH(Fecha_Pago) = '03'
AND YEAR(Fecha_Pago) = '2026'
 LIMIT 1
---
    public function ingresosMetodoPagoMes($metodo, $sucursal = 'TODOS')
    {
        $builder = $this->select('SUM(Monto) as total_monto')
                        ->where('Tipo_Pago', $metodo)
                        ->where('MONTH(Fecha_Pago)', date('m'))
                        ->where('YEAR(Fecha_Pago)', date('Y'));

        if ($sucursal !== 'TODOS') {
            $builder->where('id_gimnasio', $this->getSucursalId($sucursal));
        }

        $row = $builder->first();