app/Models/RegistroMembresiaModel.php

SELECT COUNT(*) AS `numrows`
FROM `registros_membresia`
JOIN `clientes` ON `clientes`.`IDClientes` = `registros_membresia`.`Clientes_IDClientes`
WHERE registros_membresia.Fecha_Fin = (SELECT MAX(Fecha_Fin) FROM registros_membresia rm2 WHERE rm2.Clientes_IDClientes = `registros_membresia`.`Clientes_IDClientes`)
AND `registros_membresia`.`Fecha_Fin` <= '2026-04-04 23:59:59'
---
    public function obtenerClientesParaRenovacion($telefono = null, $diasAviso = 5, $porPagina = 10)
    {
        // Límite: Hoy + los días de aviso (ej. 5 días)
        $limiteDias = date('Y-m-d', strtotime("+$diasAviso days"));

        // Seleccionamos los datos y calculamos los días restantes
        $this->select('
                clientes.IDClientes,
                clientes.Nombre,
                clientes.ApellidoP,
                clientes.Telefono,
                registros_membresia.Fecha_Fin,
                DATEDIFF(registros_membresia.Fecha_Fin, CURDATE()) AS DiasRestantes
            ')
            ->join('clientes', 'clientes.IDClientes = registros_membresia.Clientes_IDClientes')
            // TRUCO SQL: Subconsulta para traer SOLO el registro más reciente de cada cliente
            ->where('registros_membresia.Fecha_Fin = (SELECT MAX(Fecha_Fin) FROM registros_membresia rm2 WHERE rm2.Clientes_IDClientes = registros_membresia.Clientes_IDClientes)')
            // Filtramos: Que su fecha más reciente sea menor o igual al límite (incluye los ya vencidos que son fechas pasadas)
            ->where('registros_membresia.Fecha_Fin <=', $limiteDias . ' 23:59:59');

        // Si el usuario escribió un teléfono en el buscador, lo filtramos
        if (!empty($telefono)) {
            $this->like('clientes.Telefono', $telefono);
        }

        // Ordenamos: Los más atrasados (números negativos) salen primero
        $this->orderBy('DiasRestantes', 'ASC');

        // Retornamos con paginación
        return $this->paginate($porPagina);

SELECT COUNT(*) AS `numrows`
FROM `registros_membresia`
JOIN `clientes` ON `clientes`.`IDClientes` = `registros_membresia`.`Clientes_IDClientes`
WHERE `registros_membresia`.`Estatus_idEstatus` = 1
---
    public function obtenerActivasParaCambioFecha($busqueda = null, $porPagina = 10)
    {
        $this->select('registros_membresia.idRegistros_Membresia, clientes.Nombre, clientes.ApellidoP, clientes.Telefono, registros_membresia.Fecha_Fin')
             ->join('clientes', 'clientes.IDClientes = registros_membresia.Clientes_IDClientes')
             ->where('registros_membresia.Estatus_idEstatus', 1); // Solo activas

        if (!empty($busqueda)) {
            $this->groupStart()
                 ->like('clientes.Nombre', $busqueda)
                 ->orLike('clientes.ApellidoP', $busqueda)
                 ->orLike('clientes.Telefono', $busqueda)
                 ->groupEnd();
        }

        $this->orderBy('registros_membresia.Fecha_Fin', 'ASC');
        return $this->paginate($porPagina);