app/Models/Servicios.php

SELECT *
FROM `servicios`
WHERE `Catalogo` = 'MEMBRESIA'
---
    public function obtenerServiciosPorSucursal($tipoCatalogo = 'MEMBRESIA')
    {
        // 1. Cargamos el helper para saber quién está solicitando la info
        helper('gym');
        $idGymActual = obtener_id_gimnasio();

        // 2. Si es Superadmin (o no tiene restricción), le damos todo el catálogo
        if ($idGymActual === 'TODOS' || $idGymActual === null) {
            return $this->where('Catalogo', $tipoCatalogo)->findAll();